# Import required libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Creating Dataset

In [2]:
data = {"name":["Aman","Sahil","Sagar","Sahil","Aarnav","Chintu","Aman"],"English":["89","90","75","90","86","77","85"],"Hindi":["75","89","75","89","66","99","88"]}

In [14]:
df = pd.DataFrame(data)
df

     name English Hindi
0    Aman      89    75
1   Sahil      90    89
2   Sagar      75    75
3   Sahil      90    89
4  Aarnav      86    66
5  Chintu      77    99
6    Aman      85    88

In [17]:
df.drop_duplicates(inplace = True)
df

     name English Hindi
0    Aman      89    75
1   Sahil      90    89
2   Sagar      75    75
4  Aarnav      86    66
5  Chintu      77    99
6    Aman      85    88

In [18]:
dataset= pd.read_csv("loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [19]:
dataset.shape

(614, 13)

In [20]:
dataset.drop_duplicates(inplace = True)

In [21]:
dataset.shape

(614, 13)

## From the above conclusion there is no duplicate present in the dataset